{
  "aboutTitle": "Hakkımda",
  "aboutText": "Şu anda oyun geliştirme ve frontend uygulamaları üzerine odaklanıyorum. Unity(C#) ve JavaScript ile aktif olarak projeler geliştiriyorum. Akademik ve freelance deneyimlerim gömülü sistemler, artırılmış gerçeklik ve makine öğrenmesi alanlarını kapsıyor. Gerçek dünya projelerine katkıda bulundum ve RLHF tabanlı freelance görevlerde yer aldım. Ayrıca yazılım mimarisi, .NET backend geliştirme ve full-stack yapılarında kendimi geliştirdim. Bu çeşitli deneyimler beni çok yönlü ve çözüm odaklı bir geliştirici haline getirdi.",
  "experienceTitle": "Deneyim",
  "exp1title": "CMA (Stajyer)",
  "exp1desc": ".NET backend servisleri üzerinde çalıştım. CRUD işlemleri ve SQL entegrasyonları yaptım. (2024)",
  "exp2title": "RLHF Freelance Çalışması",
  "exp2desc": "Prompt değerlendirme ve dil modeli hizalama projelerinde görev aldım. (Outlier)",
  "exp3title": "NeoMobile AR Projesi",
  "exp3desc": "Arçelik için Unity ve Vuforia SDK kullanarak hata kodlarına dayalı etkileşimli bir AR kullanıcı rehberi tasarladım.",
  "projectsTitle": "Projeler",
  "project1": "Arçelik çamaşır makineleri için interaktif bir AR uygulaması geliştirdim. Unity, C# ve Vuforia SDK kullanarak gerçek zamanlı yönlendirme ve hata tabanlı çözüm adımları uyguladım. Özellikler arasında QR kod tetikleyici, adım geçişi ve kullanıcı davranışına yönelik bindirme animasyonları yer alıyor.",
  "project2": "OpenWeatherMap API kullanarak canlı hava durumu verilerini çeken responsive web uygulaması. Vanilla JavaScript, HTML ve CSS ile geliştirildi.",
  "project3": "Günlük çalışma görevlerini ve oturumlarını yönetmek için bir verimlilik aracı. Focus timer, local storage kaydı ve tema geçişi içerir. HTML/CSS ve modüler JavaScript ile geliştirildi.",
  "project4": "Unity tabanlı 3D oyun. Oyuncu, sınırlı bir sahada hedefleri toplar. Fizik, kamera takip sistemi ve giriş kontrolleri uygulandı. Temel oyun programlama ve Unity UI yönetimini gösterir.",
  "project5": "Bir şirketin test vakası için bir crossword karıştırıcı ugyulaması yaptım. Phaser ve karıştırma algoritması kullanarak verilen kelime listesi için farklı senaryolar oluşturup mevcut CrossWord oyununu görebilirsiniz. Aşağıdan bu projeye ulaşabilir ve farklı kelime listeleri ile deneyebilirsiniz.",
  "project6": "Eğitimim sırasında aldığım Makine Öğrenmesi derslerine dayalı olarak çeşitli regresyon yöntemleri ve veri setleri kullanarak çalıştığım Colab not defterlerine Google Drive üzerinden erişebilirsiniz. Bu projeler arasında kötü amaçlı yazılım sınıflandırması, alışveriş merkezi müşteri segmentasyonu, Iris veri seti, meme kanseri sınıflandırması ve tek özellik regresyonu ile Boston verisi bulunmaktadır.",
  "contactTitle": "İletişim",
  "contactDesc": "Bana aşağıdaki bağlantılardan ulaşabilirsiniz:",
  "navAbout": "Hakkımda",
  "navExperience": "Deneyim",
  "navProjects": "Projeler",
  "navContact": "İletişim",
  "subtitle": "Bilgisayar Mühendisi - Oyun & AR Geliştirici - Meraklı Öğrenici"
}