{
  "aboutTitle": "Hakkımda",
  "aboutText": "Şu anda Bolulu Hasan Usta'da Yazılım & Veri Mühendisi olarak çalışıyorum ve fabrika BT sistemlerinden sorumluyum.\nAyrıca mobil geliştirme ve yapay zeka uygulamalarına odaklanıyorum, aktif olarak Unity ve React Native ile çalışıyorum.\nAkademik ve serbest çalışma deneyimlerim gömülü sistemler, AR geliştirme ve makine öğrenimini kapsıyor.\nGerçek dünya AR projelerine katkıda bulundum ve RLHF tabanlı serbest görevlerde yer aldım, aynı zamanda yazılım mimarisi, .NET backend geliştirme ve full-stack iş akışlarındaki becerilerimi geliştirdim.\nBu çeşitli deneyimler beni çok yönlü ve çözüm odaklı bir geliştirici haline getirdi.",
  "experienceTitle": "Deneyim",

  "exp1title": "BHU - BT Uzmanı (Bilg. Mühendisi - 2025)",
  "exp1desc": "Bolulu Hasan Usta bünyesinde Yazılım Geliştirici olarak aktif olarak çalışıyorum, POS Sistemleri optimizasyonu, Google SEO analizi ve veri entegrasyon sistemleri geliştirmesi gibi çeşitli yazılım sistemlerinden sorumluyum.",
  "exp1logo": "logos/bhu-logo.png",
  "exp1color": "#d5b36b",

  "exp2title": "SCA Social - Proje Yönetimi (Stajyer - 09/2025)",
  "exp2desc": "Proje yönetimi, organizasyon yönetimi, yapay zeka, veri bilimi ve BT hukuku alanlarında portföy (üretim - tasarım) süreçlerinde yer aldım.",
  "exp2logo": "logos/sca-logo.png",
  "exp2color": "#e45404",

  "exp3title": "OutlierAI - Prompt&RLHF Mühendisi (Serbest Çalışan, 10/2024 - 01/2025)",
  "exp3desc": "Cypher ve Kepler AI modelleri için prompt değerlendirme ve dil modeli hizalama projelerinde yer aldım.",
  "exp3logo": "logos/outlierai-logo.png",
  "exp3color": "#2a6796",

  "exp4title":"Arçelik - NeoAR Mobile Rehber Projesi (Bitirme Projesi, 2023 - 2024)",
  "exp4desc":"Unity ve Vuforia SDK kullanarak Arçelik işbirliği ile makine hata kodu tabanlı çözüm aşamaları da sunan bir AR kullanıcı kılavuzu uygulaması tasarladım.",
  "exp4logo":"logos/arcelik-logo.png",
  "exp4color":"#ce1127",

  "exp5title":"Uzuner CMA - .Net Geliştirici (Stajyer - 08/2023)",
  "exp5desc":"CRUD işlemleri, full-stack geliştirme ve SQL entegrasyonlarına odaklanarak .NET backend hizmetleri üzerinde çalıştım.",
  "exp5logo":"logos/uzuner-logo.png",
  "exp5color":"#ae0269",
  
  "projectsTitle": "Projeler",
  "project1": "Arçelik çamaşır makineleri için interaktif bir AR uygulaması geliştirdim. Unity, C# ve Vuforia SDK kullanarak gerçek zamanlı yönlendirme ve hata tabanlı çözüm adımları uyguladım. Özellikler arasında QR kod tetikleyici, adım geçişi ve kullanıcı davranışına yönelik bindirme animasyonları yer alıyor.",
  "project2": "OpenWeatherMap API kullanarak canlı hava durumu verilerini çeken responsive web uygulaması. Vanilla JavaScript, HTML ve CSS ile geliştirildi.",
  "project3": "Günlük çalışma görevlerini ve oturumlarını yönetmek için bir verimlilik aracı. Focus timer, local storage kaydı ve tema geçişi içerir. HTML/CSS ve modüler JavaScript ile geliştirildi.",
  "project4": "Unity tabanlı 3D oyun. Oyuncu, sınırlı bir sahada hedefleri toplar. Fizik, kamera takip sistemi ve giriş kontrolleri uygulandı. Temel oyun programlama ve Unity UI yönetimini gösterir.",
  "project5": "Bir şirketin test vakası için bir crossword karıştırıcı ugyulaması yaptım. Phaser ve karıştırma algoritması kullanarak verilen kelime listesi için farklı senaryolar oluşturup mevcut CrossWord oyununu görebilirsiniz. Aşağıdan bu projeye ulaşabilir ve farklı kelime listeleri ile deneyebilirsiniz.",
  "project6": "Eğitimim sırasında aldığım Makine Öğrenmesi derslerine dayalı olarak çeşitli regresyon yöntemleri ve veri setleri kullanarak çalıştığım Colab not defterlerine Google Drive üzerinden erişebilirsiniz. Bu projeler arasında kötü amaçlı yazılım sınıflandırması, alışveriş merkezi müşteri segmentasyonu, Iris veri seti, meme kanseri sınıflandırması ve tek özellik regresyonu ile Boston verisi bulunmaktadır.",
  "contactTitle": "İletişim",
  "contactDesc": "Bana aşağıdaki bağlantılardan ulaşabilirsiniz:",
  "navAbout": "Hakkımda",
  "navExperience": "Deneyim",
  "navProjects": "Projeler",
  "navContact": "İletişim",
  "subtitle": "Bilgisayar Mühendisi - Oyun & AR Geliştirici - Meraklı Öğrenici"
}